In [12]:
import pandas as pd

# reading csv file 
df = pd.read_csv(r"D:/DEBI/stdents_grades.csv")
print(df)

     #                       Team Members       ID  Grade
0    1            Abdalrahman Osama Ahmed  2430126   20.0
1    1            Mohamed Mosatafa Salman  2430100   20.0
2    1             Ramy Ashraf Abdelmaseh  2430178   21.0
3    1             Youssef Mohamed Ismail  2430193   20.5
4    2       Ahmed Mohamed Ahmed Abdelaal  4210486   19.0
5    2  Mohamed Ahmed Mohamed Abdelmoniem  4212510   20.0
6    2               Marwan Mohamed Abbas  4212512   20.0
7    2   Ahmed Hany Abdelwahab Abdelgawad  4210017   21.0
8    3        Abdelrahman Ibrahim Mohamed  2430493   25.0
9    3            Ahmed Emad Mohamed Reda  2430180   25.0
10   3               Amr Ahmed Abdelzaher  2430074   24.0
11   3            Amr Yasser Salah El-Din  2430380   25.0
12   4                     Bahga Mohammed  2430498   15.0
13   4                 Anas Samy Alsirafy  2430358   15.0
14   4  Mohammed Abd El Twab Abd El Fatah  4210215   15.0
15   4                  Nada Hesham Anwer  2430185   15.0
16   5                Yomna Osama Hussein  2430203   26.0
17   5           Mostafa Osama Abdelzaher  2430173   26.0
18   5            Omar Mohamed Ahmed Amin  2430204   26.0
19   5    Youssef Mohamed Mahmoud Shaaban  2430202   26.0
20   6                      Habiba Hassan  2430369   22.0
21   6                      Mahinour Alaa  2430339   21.0
22   6                     Rofayda Bassem  2430220   22.0
23   6                     Youssef Khaled  2430324   22.0
24   6                  Omar Sherif Galal  2430039   22.0
25   7                 Ahmed Youssef Amer  4210394   21.0
26   7            Ahmed Alaaeldin Ibrahim  4210016   21.0
27   7                     omar Saeed Ali  4210038   21.0
28   7               bassant reda mohamed  2430056   21.0
29   8                           Hla Hany  2430344   17.0
30   8                          Omar Alaa  2430377   16.0
31   8                       Omar Nashaat  2430430   17.0
32   8                         Rana Gamal  2430449   15.0
33   9                        Ahmed Maher  2430290   21.0
34   9                     Khalid Mamdouh  2430321   21.0
35   9               Marwan Ahmed Mustafa  2430281   22.0
36   9                   Seif El-Baghdady  2430243   22.0
37  10                   Daniel Adel Aziz  4210024   19.0
38  10                  David George Adel  4210849   15.0
39  10                 Nardeen Hany Milad  4210483   19.0
40  10                Peter Ashraf Moussa  4212501   19.0

In [26]:

data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team1_df = data[data['#'] ==1]

display(team1_df)

   #             Team Members       ID  Grade
0  1  Abdalrahman Osama Ahmed  2430126   20.0
1  1  Mohamed Mosatafa Salman  2430100   20.0
2  1   Ramy Ashraf Abdelmaseh  2430178   21.0
3  1   Youssef Mohamed Ismail  2430193   20.5

In [27]:
average = team1_df["Grade"].mean()
print(average)

20.375

In [60]:
max1 = team1_df[["Grade","Team Members","ID"]].max()
print(max1)

Grade                             21.0
Team Members    Youssef Mohamed Ismail
ID                             2430193
dtype: object

In [58]:
sorted_team1 = team1_df.sort_values(by='Grade')
print(sorted_team1)

   #             Team Members       ID  Grade
0  1  Abdalrahman Osama Ahmed  2430126   20.0
1  1  Mohamed Mosatafa Salman  2430100   20.0
3  1   Youssef Mohamed Ismail  2430193   20.5
2  1   Ramy Ashraf Abdelmaseh  2430178   21.0

In [15]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team2_df = data[data['#'] ==2]
display(team2_df)

   #                       Team Members       ID  Grade
4  2       Ahmed Mohamed Ahmed Abdelaal  4210486   19.0
5  2  Mohamed Ahmed Mohamed Abdelmoniem  4212510   20.0
6  2               Marwan Mohamed Abbas  4212512   20.0
7  2   Ahmed Hany Abdelwahab Abdelgawad  4210017   21.0

In [28]:
average2 = team2_df["Grade"].mean()
print(average2)

20.0

In [61]:
max2 = team2_df[["Grade","Team Members","ID"]].max()
print(max2)

Grade                                        21.0
Team Members    Mohamed Ahmed Mohamed Abdelmoniem
ID                                        4212512
dtype: object

In [57]:
sorted_team2 = team2_df.sort_values(by='Grade')
print(sorted_team2)

   #                       Team Members       ID  Grade
4  2       Ahmed Mohamed Ahmed Abdelaal  4210486   19.0
5  2  Mohamed Ahmed Mohamed Abdelmoniem  4212510   20.0
6  2               Marwan Mohamed Abbas  4212512   20.0
7  2   Ahmed Hany Abdelwahab Abdelgawad  4210017   21.0

In [16]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team3_df = data[data['#'] ==3]
display(team3_df)

    #                 Team Members       ID  Grade
8   3  Abdelrahman Ibrahim Mohamed  2430493   25.0
9   3      Ahmed Emad Mohamed Reda  2430180   25.0
10  3         Amr Ahmed Abdelzaher  2430074   24.0
11  3      Amr Yasser Salah El-Din  2430380   25.0

In [62]:
max3 = team3_df[["Grade","Team Members","ID"]].max()
print(max3)

Grade                              25.0
Team Members    Amr Yasser Salah El-Din
ID                              2430493
dtype: object

In [29]:
average3 = team3_df["Grade"].mean()
print(average3)

24.75

In [56]:
sorted_team3 = team3_df.sort_values(by='Grade')
print(sorted_team3)

    #                 Team Members       ID  Grade
10  3         Amr Ahmed Abdelzaher  2430074   24.0
8   3  Abdelrahman Ibrahim Mohamed  2430493   25.0
9   3      Ahmed Emad Mohamed Reda  2430180   25.0
11  3      Amr Yasser Salah El-Din  2430380   25.0

In [17]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team4_df = data[data['#'] ==4]
display(team4_df)

    #                       Team Members       ID  Grade
12  4                     Bahga Mohammed  2430498   15.0
13  4                 Anas Samy Alsirafy  2430358   15.0
14  4  Mohammed Abd El Twab Abd El Fatah  4210215   15.0
15  4                  Nada Hesham Anwer  2430185   15.0

In [30]:
average4 = team4_df["Grade"].mean()
print(average4)

15.0

In [63]:
max4 = team4_df[["Grade","Team Members","ID"]].max()
print(max4)

Grade                        15.0
Team Members    Nada Hesham Anwer
ID                        4210215
dtype: object

In [55]:
sorted_team4 = team4_df.sort_values(by='Grade')
print(sorted_team4)

    #                       Team Members       ID  Grade
12  4                     Bahga Mohammed  2430498   15.0
13  4                 Anas Samy Alsirafy  2430358   15.0
14  4  Mohammed Abd El Twab Abd El Fatah  4210215   15.0
15  4                  Nada Hesham Anwer  2430185   15.0

In [18]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team5_df = data[data['#'] ==5]
display(team5_df)

    #                     Team Members       ID  Grade
16  5              Yomna Osama Hussein  2430203   26.0
17  5         Mostafa Osama Abdelzaher  2430173   26.0
18  5          Omar Mohamed Ahmed Amin  2430204   26.0
19  5  Youssef Mohamed Mahmoud Shaaban  2430202   26.0

In [31]:
average5 = team5_df["Grade"].mean()
print(average5)

26.0

In [64]:
max5 = team5_df[["Grade","Team Members","ID"]].max()
print(max5)

Grade                                      26.0
Team Members    Youssef Mohamed Mahmoud Shaaban
ID                                      2430204
dtype: object

In [54]:
sorted_team5 = team5_df.sort_values(by='Grade')
print(sorted_team5)

    #                     Team Members       ID  Grade
16  5              Yomna Osama Hussein  2430203   26.0
17  5         Mostafa Osama Abdelzaher  2430173   26.0
18  5          Omar Mohamed Ahmed Amin  2430204   26.0
19  5  Youssef Mohamed Mahmoud Shaaban  2430202   26.0

In [19]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team6_df = data[data['#'] ==6]
display(team6_df)

    #       Team Members       ID  Grade
20  6      Habiba Hassan  2430369   22.0
21  6      Mahinour Alaa  2430339   21.0
22  6     Rofayda Bassem  2430220   22.0
23  6     Youssef Khaled  2430324   22.0
24  6  Omar Sherif Galal  2430039   22.0

In [32]:
average6 = team6_df["Grade"].mean()
print(average6)

21.8

In [65]:
max6 = team6_df[["Grade","Team Members","ID"]].max()
print(max6)

Grade                     22.0
Team Members    Youssef Khaled
ID                     2430369
dtype: object

In [53]:
sorted_team6 = team6_df.sort_values(by='Grade')
print(sorted_team6)

    #       Team Members       ID  Grade
21  6      Mahinour Alaa  2430339   21.0
20  6      Habiba Hassan  2430369   22.0
22  6     Rofayda Bassem  2430220   22.0
23  6     Youssef Khaled  2430324   22.0
24  6  Omar Sherif Galal  2430039   22.0

In [20]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team7_df = data[data['#'] ==7]
display(team7_df)

    #             Team Members       ID  Grade
25  7       Ahmed Youssef Amer  4210394   21.0
26  7  Ahmed Alaaeldin Ibrahim  4210016   21.0
27  7           omar Saeed Ali  4210038   21.0
28  7     bassant reda mohamed  2430056   21.0

In [33]:
average7 = team7_df["Grade"].mean()
print(average7)

21.0

In [66]:
max7 = team7_df[["Grade","Team Members","ID"]].max()
print(max7)

Grade                     21.0
Team Members    omar Saeed Ali
ID                     4210394
dtype: object

In [52]:
sorted_team7 = team7_df.sort_values(by='Grade')
print(sorted_team7)

    #             Team Members       ID  Grade
25  7       Ahmed Youssef Amer  4210394   21.0
26  7  Ahmed Alaaeldin Ibrahim  4210016   21.0
27  7           omar Saeed Ali  4210038   21.0
28  7     bassant reda mohamed  2430056   21.0

In [21]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team8_df = data[data['#'] ==8]
display(team8_df)

    #  Team Members       ID  Grade
29  8      Hla Hany  2430344   17.0
30  8     Omar Alaa  2430377   16.0
31  8  Omar Nashaat  2430430   17.0
32  8    Rana Gamal  2430449   15.0

In [34]:
average8 = team8_df["Grade"].mean()
print(average8)

16.25

In [67]:
max8 = team8_df[["Grade","Team Members","ID"]].max()
print(max8)

Grade                 17.0
Team Members    Rana Gamal
ID                 2430449
dtype: object

In [51]:
sorted_team8 = team8_df.sort_values(by='Grade')
print(sorted_team8)

    #  Team Members       ID  Grade
32  8    Rana Gamal  2430449   15.0
30  8     Omar Alaa  2430377   16.0
29  8      Hla Hany  2430344   17.0
31  8  Omar Nashaat  2430430   17.0

In [22]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team9_df = data[data['#'] ==9]
display(team9_df)

    #          Team Members       ID  Grade
33  9           Ahmed Maher  2430290   21.0
34  9        Khalid Mamdouh  2430321   21.0
35  9  Marwan Ahmed Mustafa  2430281   22.0
36  9      Seif El-Baghdady  2430243   22.0

In [69]:
average9 = team9_df["Grade"].mean()
print(average9)

21.5

In [70]:
max9 = team9_df[["Grade","Team Members","ID"]].max()
print(max)

26.0

In [50]:
sorted_team9 = team9_df.sort_values(by='Grade')
print(sorted_team9)

    #          Team Members       ID  Grade
33  9           Ahmed Maher  2430290   21.0
34  9        Khalid Mamdouh  2430321   21.0
35  9  Marwan Ahmed Mustafa  2430281   22.0
36  9      Seif El-Baghdady  2430243   22.0

In [23]:
data = pd.DataFrame(df)

# Filter rows where Age is greater than 30
team10_df = data[data['#'] ==10]
display(team10_df)

     #         Team Members       ID  Grade
37  10     Daniel Adel Aziz  4210024   19.0
38  10    David George Adel  4210849   15.0
39  10   Nardeen Hany Milad  4210483   19.0
40  10  Peter Ashraf Moussa  4212501   19.0

In [36]:
average10 = team10_df["Grade"].mean()
print(average10)

18.0

In [71]:
max10 = team10_df[["Grade","Team Members","ID"]].max()
print(max10)

Grade                          19.0
Team Members    Peter Ashraf Moussa
ID                          4212501
dtype: object

In [48]:
min10 = team10_df["Grade"].min()
print(min10)

15.0

In [49]:
sorted_team10 = team10_df.sort_values(by='Grade')
print(sorted_team10)

     #         Team Members       ID  Grade
38  10    David George Adel  4210849   15.0
37  10     Daniel Adel Aziz  4210024   19.0
39  10   Nardeen Hany Milad  4210483   19.0
40  10  Peter Ashraf Moussa  4212501   19.0

In [72]:
max =df[["Grade","Team Members","ID"]].max()
print(max)

Grade                     26.0
Team Members    omar Saeed Ali
ID                     4212512
dtype: object